<?php
$banks_bankinform = array(
	'Абсолют Банк' => 83,
	'АК БАРС банк' => 34,
	'Альфа-банк ( 8 Марта, 10)' => 35,
	'Балтийский Банк' => 57,
	'Банк "АГРОПРОМКРЕДИТ"' => 12,
	'Банк "Вятич"' => 36,
	'Банк "Монетный дом" (МЕЧЕЛ-БАНК) (8 Марта, 37)' => 49,
	'Банк "Монетный дом" (МЕЧЕЛ-БАНК) (Красноармейская, 78б)' => 49,
	'Банк "Монетный дом" (МЕЧЕЛ-БАНК) (Крауля, 53)' => 49,
	'Банк "Монетный дом" (МЕЧЕЛ-БАНК) (Ленина, 58)' => 49,
	'Банк "Монетный дом" (МЕЧЕЛ-БАНК) (Ленина, 7)' => 49,
	'Банк "Монетный дом" (МЕЧЕЛ-БАНК) (Свердлова, 14)' => 49,
	'Банк "УралСиб"' => 18,
	'Банк "Уралфинанс" (Мамина Сибиряка, 111)' => 31,
	'Банк ВЕФК - Урал' => 14,
	'Банк Москвы' => 41,
	'Банк Москвы (Восточная, 7г,	Свердлова, 14)' => 41,
	'Банк Москвы (Малышева, 31д, Ленина, 79б)' => 41,
	'Банк СОЮЗ (Розы Люксембург, 37)' => 56,
	'Банк24.ру (Белореченская, 8, Ленина, 48)' => 6,
	'Банк24.ру (Восточная, 11Б, Ленина, 22а)' => 6,
	'Банк24.ру (Ленина, 56)' => 6,
	'Банк24.ру (Малышева, 29, Шварца, 14)' => 6,
	'Банк24.ру (Малышева, 53, Куйбышева,12)' => 6,
	'Банк24.ру (Малышева, 84)' => 6,
	'Банк24.ру (Машиностроителей, 19)' => 6,
	'БИНБАНК' => 42,
	'ВТБ 24' => 43,
	'ВУЗ-банк' => 5,
	'Газпромбанк' => 44,
	'Екатер. муниципальный банк (8 Марта, 13)' => 20,
	'КМБ-БАНК' => 46,
	'Кольцо Урала' => 21,
	'МБА-Москва' => 47,
	'МБРР' => 48,
	'МДМ-Банк (8 Марта, 32а)' => 85,
	'МДМ-Банк (Ленина, 20)' => 85,
	'МДМ-Банк (Малышева, 53)' => 85,
	'МЕГА БАНК (Мамина-Сибиряка, 132)' => 84,
	'МЕТКОМБАНК' => 15,
	'НОМОС-БАНК' => 67,
	'ОРГРЭСБАНК' => 117,
	'Первый Республиканский Банк' => 100,
	'Промсвязьбанк  (Мамина-Сибиряка, 70; Николая Никонова, 4)' => 86,
	'Промышленно-торговый банк (40-летия Октября, 42, кор.1)' => 65,
	'Русь-банк (Красноармейская, 41)' => 90,
	'Русь-Банк-Урал' => 90,
	'СБ "Губернский"' => 28,
	'СБ Банк' => 115,
	'Сберинвестбанк' => 27,
	'Сберинвестбанк (Малышева, 98)' => 27,
	'Связь-банк' => 52,
	'Северная казна' => 7,
	'СКБ-банк (Куйбышева, 75)' => 8,
	'СМП Банк' => 101,
	'Тагилбанк' => 82,
	'ТрансКапиталБанк' => 91,
	'ТрансКредитБанк' => 53,
	'УИК-Банк' => 29,
	'Уралприватбанк (Первомайская, 26)' => 30,
	'Уралтрансбанк' => 13,
	'Уралфинпромбанк (Амундсена, 64)' => 32,
	'Уралфинпромбанк (Крауля, 2)' => 32,
	'Уралфинпромбанк (Сибирский тракт, 8б)' => 32,
	'Уралфинпромбанк (Старых большевиков, 77)' => 32,
	'Уралфинпромбанк (Шевченко, 9)' => 32,
	'Уральский Банк Реконструкции и Развития' => 10,
	'Уральский банк Сбербанка РФ (Московская,11)' => 60,
	'Уральский межрегиональный банк' => 33,
	'УРСА Банк' => 11,
	'Ф-ал ЗАО "Первоуральскбанк" "Газ-Инвест" ' => 23,
	'Филиал "ГРАН" АКБ "Инвестбанк"' => 19,
	'Филиал ОАО Банк ВТБ в г. Екатеринбурге' => 1,
	'ЧЕЛИНДБАНК' => 88,
	'Банк24.ру (Малышева, 29)' => 6,
	'Банк24.ру (Машиностроителей, 19, Шварца, 14)' => 6,
	'ЛОКО-банк' => 96,
	'НБ «ТРАСТ»' => 50,
	'Уралфинпромбанк (Амундсена, 64, Учителей, 8)' => 32,
	'Уралфинпромбанк (Шевченко, 9, Фурманова, 123)' => 0,
	'Юниаструм Банк' => 55,
	'Уралфинпромбанк (Амундсена, 64, Фурманова, 123)' => 0,
	'Уралфинпромбанк (Крауля, 2, Сибирский тракт, 8б)' => 0,
	'Уралфинпромбанк (Учителей, 8)' => 0,
	'Уралфинпромбанк (Шевченко, 9, Толмачева, 21а)' => 0,
	'Банк24.ру (Шварца, 14)' => 6,
	'Уралфинпромбанк (Ломоносова, 55)' => 0,
	'Уралфинпромбанк (Старых большевиков, 77, Учителей, 8)' => 0,
	'СКБ-банк ' => 8,
	'Судостроительный банк (СБ Банк)' => 0,
	'Городской Ипотечный Банк' => 0,
	'КМБ БАНК' => 0,
	'Инвестторгбанк' => 0,
	'Банк «Резерв»' => 0,
	'Банк "Монетный дом" (МЕЧЕЛ-БАНК) (Белинского, 163г)' => 0,
	'Россельхозбанк' => 0,
	'Банк «Резерв» (Малышева, 29) ' => 0,
	'Уралфинпромбанк (Юмашева, 7, Ломоносова, 55)' => 0,
	'Инвестторгбанк (Московская, 1)' => 0,
	'Банк "Уралфинанс" (Кузнечная, 83)' => 0,
	'Городской Ипотечный Банк (К.Цеткин, 4)' => 0,
	'Удмуртинвестстройбанк ' => 0,
	'Банк "Монетный дом"	(8 Марта, 37)' => 0,
	'Банк "Монетный дом"	(Белинского, 163г)' => 0,
	'Банк "Монетный дом"	(Красноармейская, 78б)' => 0,
	'Банк "Монетный дом"	(Крауля, 53)' => 0,
	'Банк "Монетный дом"	(Ленина, 58)' => 0,
	'Банк "Монетный дом"	(Ленина, 7)' => 0,
	'Банк "Монетный дом"	(Свердлова, 14)' => 0,
	'МДМ-Банк ' => 0,
	'ЮниКредит Банк' => 80,
	'Банк24.ру (Куйбышева,12)' => 0,
	'Банк24.ру (Ленина, 56, Малышева, 53)' => 0,
	'Банк24.ру (Аэропорт "Кольцово")' => 0,
	'Банк24.ру (Куйбышева,12, Шварца, 14)' => 0,
	'Транснациональный банк' => 0,
	'ТрансКапиталБанк (Чернышевского, 16)' => 0,
	'Городской Ипотечный Банк, ООО (К.Цеткин, 4)' => 0,
	'Уралфинпромбанк' => 0,
	'Альфа-банк ( 8 Марта, 10, Горького, 17)' => 0,
	'Банк «НЕЙВА»' => 0,
	'МДМ Банк' => 0,
	'Уралфинпромбанк (Толмачева, 21а)' => 0,
	'ТрансКапиталБанк (Техническая, 19)' => 0,
	'Транснациональный банк (Белинского, 32)' => 0,
	'Нордеа Банк' => 0,
	'ЛОКО-банк (Радищева,31)' => 0,
	'Банк "АГРОПРОМКРЕДИТ" (М. Сибиряка, 140)' => 0,
	'Русь-Банк-Урал (Гагарина, 14)' => 0,
	'Русь-Банк-Урал (Волгоградская, 47б)' => 0,
	'Русь-Банк-Урал (Грибоедова, 32, Шварца, 17)' => 0,
	'Русь-Банк-Урал (Сакко и Ванцетти, 41, М. Сибиряка, 145)' => 0,
	'Русь-Банк-Урал (Татищева, 90, Виз-бульвар, 13)' => 0,
	'Банк "Монетный дом"	(8 Марта, 37, Малышева, 58а)' => 0,
	'СМП Банк (Карла Либкнехта, 16) ' => 0,
	'СМП Банк (Ленина, 89)' => 0,
	'Уралфинпромбанк (Учителей, 8а)' => 0,
	'Банк "НЕЙВА"' => 0,
	'Банк "Регион"' => 0,
	'Банк "Резерв" (Малышева, 29) ' => 0,
	'НБ "ТРАСТ"' => 0,
	'Абсолют Банк (Белинского, 61)' => 0,
	'Абсолют Банк (Челюскинцев, 31)' => 0,
	'Банк Русский Стандарт' => 0,
	'Банк Интеза' => 0,
	'Банк Интеза (КМБ БАНК)' => 0,
	'Русь-Банк (Гагарина, 14)' => 0,
	'Русь-Банк ' => 0,
	'Юниаструм Банк (Энгельса, 17)' => 0,
	'ВУЗ-банк (Малышева, 31б, Крауля, 44)' => 0,
	'ВУЗ-банк (Амундсена, 65, Вайнера, 10)' => 0,
	'ВУЗ-банк (Ленина, 50, Родонитовая, 23)' => 0,
	'Банк "НЕЙВА" (Декабристов, 75)' => 0,
	'Банк "НЕЙВА" (Космонавтов, 40)' => 0,
	'Банк "НЕЙВА" (Крауля, 2)' => 0,
	'Международный Промышленный Банк' => 0,
	'Банк "Адмиралтейский"' => 0,
	'Сберинвестбанк (Белинского, 56, Шаумяна, 73)' => 0,
	'Сберинвестбанк (Орджоникидзе, 3, Кобозева, 29а)' => 0,
	'Уралфинпромбанк (Сибирский Тракт 8б)' => 0,
	'Уралфинпромбанк (Крауля, 2а)' => 0,
	'Уралинкомбанк' => 0,
	'Уралфинпромбанк (Сибирский Тракт, 8)' => 0,
	'Уралфинпромбанк (Толмачева, 21)' => 0,
	'Удмуртинвестстройбанк (Малышева, 71 А) ' => 0,
	'РУСИЧ ЦЕНТР БАНК' => 0,
	'Уралфинпромбанк (Юмашева, 7)' => 0,
	'РУСИЧ ЦЕНТР БАНК (Народной воли, 69) ' => 0,
	'Банк "НЕЙВА" (Шварца, 14)' => 0,
	'Банк "НЕЙВА" (Ленина, 48)' => 0,
	'БАЛТИНВЕСТБАНК (Большакова, 70)' => 0,
	'Россельхозбанк (Пушкина, 2а)' => 0,
	'Уралинкомбанк (Сакко и Ванцетти, 47, Родонитовая, 10)' => 0,
	'ЛОКО-банк (Ленина, 38а)' => 0,
	'Банк Москвы (Жукова, 10)' => 0,
	'Банк "Резерв" (Малышева, 29, Восточная, 7Д) ' => 0,
	'Банк ЗЕНИТ' => 0,
	'МОСОБЛБАНК' => 0,
	'Связной Банк (40-летия Октября, 42, кор.1)' => 0,
	'Национальный Резервный Банк' => 0,
	'Национальный Резервный Банк (Степана Разина, 16)' => 0,
	'Банк Москвы (Свердлова, 14, Восточная, 7г)' => 0,
	'Восточный экспресс банк' => 0,
	'Альфа-банк(Горького, 17; 8 Марта, 10)' => 0,
	'Банк «АГРОПРОМКРЕДИТ»(Мамина-Сибиряка, 140)' => 0,
	'Банк «Вятич»' => 0,
	'БАНК УРАЛСИБ' => 0,
	'Банк «Уралфинанс»(Мамина-Сибиряка, 111)' => 0,
	'Филиал «ГРАН»	АКБ «Инвестбанк»' => 0,
	'Банк Москвы(Маршала Жукова, 10)' => 0,
	'Банк Москвы(Восточная, 7г; Свердлова, 14)' => 0,
	'Банк Москвы(Малышева, 31д; Ленина, 79б)' => 0,
	'Банк24.ру(Бахчиванджи, 1)' => 0,
	'Банк24.ру(Куйбышева, 12; Шварца, 14)' => 0,
	'Банк24.ру(Машиностроителей, 19)' => 0,
	'Банк24.ру(Ленина, 56; Малышева, 53)' => 0,
	'Банк24.ру(Малышева, 84)' => 0,
	'ВТБ24' => 0,
	'ВУЗ-банк(Малышева, 31б; Крауля, 44)' => 0,
	'Екатеринбургский муниципальный банк(8 Марта, 13)' => 0,
	'Московский Банк Реконструкции и Развития' => 0,
	'Связной Банк (40-летия Октября, 42, корп. 1)' => 0,
	'СБ «Губернский»' => 0,
	'Сберинвестбанк(Шаумяна, 73; Белинского, 56)' => 0,
	'Уралприватбанк(Первомайская, 26)' => 0,
	'Уралфинпромбанк(Учителей, 8)' => 0,
	'Уралфинпромбанк(Крауля, 2)' => 0,
	'Уральский банк Сбербанка РФ(Московская, 11)' => 0,
	'Банк «Монетный дом» (Ленина, 7)' => 0,
	'Ф-ал «Первоуральскбанк»	«Газ-Инвест»' => 0,
	'Банк24.ру(Восточная, 11б; Ленина, 22а)' => 0,
	'Банк «Монетный дом» (Крауля, 53)' => 0,
	'Уралфинпромбанк(Толмачева, 21)' => 0,
	'Уралфинпромбанк(Юмашева, 7)' => 0,
	'Банк СОЮЗ(Розы Люксембург, 37)' => 0,
	'Абсолют Банк(Белинского, 61)' => 0,
	'Сберинвестбанк(Малышева, 98)' => 0,
	'Уралинкомбанк(Родонитовая, 10; Сакко и Ванцетти, 47)' => 0,
	'Банк24.ру(Ленина, 48; Белореченская, 8)' => 0,
	'Банк «Монетный дом» (8 Марта, 37)' => 0,
	'Банк «Монетный дом» (Ленина, 58)' => 0,
	'ЮНИАСТРУМ БАНК(Энгельса, 17)' => 0,
	'Инвестторгбанк(Московская, 1)' => 0,
	'Банк «Резерв»(Малышева, 29; Восточная, 7Д)' => 0,
	'Россельхозбанк(Пушкина, 2а)' => 0,
	'Банк «Монетный дом» (Белинского, 163г)' => 0,
	'Банк «Уралфинанс»(Кузнечная, 83)' => 0,
	'Удмуртинвестстройбанк(Малышева, 71 А)' => 0,
	'Транснациональный банк(Белинского, 32)' => 0,
	'Банк «НЕЙВА»(Шварца, 14)' => 0,
	'Уралфинпромбанк(Сибирский тракт, 8)' => 0,
	'Банк «Регион»' => 0,
	'ВУЗ-банк(Вайнера, 10; Амундсена, 65)' => 0,
	'ВУЗ-банк(Ленина, 50; Родонитовая, 23)' => 0,
	'Банк «НЕЙВА»(Крауля, 2)' => 0,
	'Банк «НЕЙВА»(Космонавтов, 40)' => 0,
	'Банк «Адмиралтейский»' => 0,
	'Сберинвестбанк(Кобозева, 29а; Орджоникидзе, 3)' => 0,
	'РУСИЧ ЦЕНТР БАНК(Народной воли, 69)' => 0,
	'Банк «НЕЙВА»(Ленина, 48)' => 0,
	'БАЛТИНВЕСТБАНК(Большакова, 70)' => 0,
	'Национальный Резервный Банк(Степана Разина, 16)' => 0,
	'Банк «АГРОПРОМКРЕДИТ»' => 0,
	'Банк24.ру(Ленина, 56)' => 0,
	'Банк24.ру(Малышева, 84; Малышева, 53)' => 0,
	'Промсвязьбанк (Николая Никонова, 4)' => 0,
	'Промсвязьбанк (Мамина-Сибиряка, 70; Николая Никонова, 4)' => 0,
	'Промсвязьбанк (Мамина-Сибиряка, 70)' => 0,
);







function saxStartElement($parser,$name,$attrs)
{
    global $cur_bank,$index, $cur_currency;

    switch($name)
    {
        case 'banks':
$news = array();
break;
        case 'bank':
$cur_bank = array();
if (in_array('date',array_keys($attrs)))
    $currentNews['date'] = $attrs['date'];
break;
        case 'name':
$index = 'name';
break;
        case 'eur':
$cur_currency = 'EUR';
break;
        case 'usd':
$cur_currency = 'USD';
break;
        case 'buy':
$index = $cur_currency.'_buy';
break;
        case 'sale':
$index = $cur_currency.'_sale';
break;
        default:
$index = $name;
break;
    };
}

// Функция для обработки конечных тегов XML
// На входе:
//   - указатель на SAX парсер
//   - имя XML тега
function saxEndElement($parser,$name)
{
    global $ar_banks,$cur_bank,$index;

    if ((is_array($cur_bank)) && ($name=='bank'))
    {
        $ar_banks[] = $cur_bank;
        $cur_bank = null;
    };
    $index = null;
}

// Функция для обработки символьных данных
// На входе:
//   - указатель на SAX парсер
//   - символьные данные XML
function saxCharacterData($parser,$data)
{
    global $cur_bank,$index;
    if ((is_array($cur_bank)) && ($index))
        $cur_bank[$index] = $data;
}
?>